Tekla.Structures.Drawing.ArrowheadPositions
The positions of the arrowheads on the line.

Tekla.Structures.Drawing.ArrowheadPositions.None
No arrowheads on the line.

Tekla.Structures.Drawing.ArrowheadPositions.Start
One arrowhead at the start of the line.

Tekla.Structures.Drawing.ArrowheadPositions.End
One arrowhead at the end of the line.

Tekla.Structures.Drawing.ArrowheadPositions.Both
Arrowheads at both ends of the line.